{
  "backend/main.mo": "Minimal actor placeholder with no implemented logic.",
  "feature_evidence.json": "Feature evidence report describing added frontend env configuration files for draft and live builds.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend source files related to Solitaire game logic, UI, hooks, and styling.",
  "frontend/.env.draft": "Draft environment settings enabling draft mode, disabling advanced shading, and using img card rendering.",
  "frontend/.env.live.example": "Example production environment settings enabling live mode, full visual effects, and DOM-based card rendering.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color tokens and theming variables for light and dark modes.",
  "frontend/index.html": "HTML entry point with root mount element and default noindex robots policy.",
  "frontend/README-publishing.md": "Documentation explaining maintenance, draft, and live publishing states and how to configure them.",
  "frontend/src/App.tsx": "App component selecting maintenance, draft, or live mode UI and applying robots policy.",
  "frontend/src/components/DraftIndicator.tsx": "Displays a small fixed-position badge when the app is in draft mode.",
  "frontend/src/components/MaintenanceMode.tsx": "Centered maintenance screen with icon and status messaging.",
  "frontend/src/config/cardRenderMode.ts": "Reads card rendering mode from env and exports flags for DOM, background-image, or img rendering.",
  "frontend/src/config/publishing.ts": "Determines publishing state from environment variables with legacy compatibility handling.",
  "frontend/src/config/visualEffects.ts": "Reads env flag controlling whether advanced shading effects are disabled.",
  "frontend/src/features/solitaire/components/cardBackgroundImages.ts": "Generates SVG-based image and CSS background sources for card faces and backs based on card properties.",
  "frontend/src/features/solitaire/components/CardView.tsx": "Card rendering component supporting DOM, background-image, and img modes with selection and drag behavior.",
  "frontend/src/features/solitaire/components/GameControls.tsx": "Renders buttons for new game, undo, hint, scores, and preferences with handlers and undo disabling.",
  "frontend/src/features/solitaire/components/GameMoves.tsx": "Displays move count or a disabled message depending on tracking state.",
  "frontend/src/features/solitaire/components/GamePreferencesDialog.tsx": "Dialog allowing users to toggle timer, move tracking, and ask-again preferences, resetting values when opened.",
  "frontend/src/features/solitaire/components/GameTimer.tsx": "Shows the formatted game timer or a disabled message based on settings.",
  "frontend/src/features/solitaire/components/NewGamePreferencesDialog.tsx": "Dialog for selecting timer and move-tracking preferences before starting a new game, resetting to defaults when opened.",
  "frontend/src/features/solitaire/components/PileView.tsx": "Displays waste, foundation, or tableau piles with drag-and-drop support and card interaction behaviors.",
  "frontend/src/features/solitaire/components/ScoresDialog.tsx": "Leaderboard dialog showing best times and fewest moves with scrollable lists and formatting.",
  "frontend/src/features/solitaire/components/WinDialog.tsx": "Win screen dialog showing current results and top scores with timing and move-tracking support.",
  "frontend/src/features/solitaire/hooks/useGameTimer.ts": "React hook providing a start/stop game timer with formatted time output and reset on game change.",
  "frontend/src/features/solitaire/preferences/solitairePreferences.ts": "Loads and saves user preferences for timer, move tracking, and prompts using localStorage.",
  "frontend/src/features/solitaire/results/usePlaythroughResults.ts": "Manages persisted playthrough results with add, sort, and time-format utilities using localStorage.",
  "frontend/src/features/solitaire/solitaireDrag.ts": "Handles drag-and-drop payload encoding, decoding, and conversion to card selection objects.",
  "frontend/src/features/solitaire/solitaireHint.ts": "Computes the next valid hint by scanning move priorities across waste, tableau, and foundations.",
  "frontend/src/features/solitaire/solitaireHistory.ts": "Implements snapshot-based history for undo support, storing past states and move counts.",
  "frontend/src/features/solitaire/solitaireLogic.ts": "Contains core Solitaire logic including deck creation, shuffling, dealing, movement rules, and stock drawing.",
  "frontend/src/features/solitaire/SolitairePage.tsx": "Main Solitaire page managing game state, dialogs, timers, preferences, and win-result recording.",
  "frontend/src/features/solitaire/solitaireTypes.ts": "Defines core Solitaire types, constants, and helpers for suits, ranks, cards, and selections.",
  "frontend/src/features/solitaire/solitaireWin.ts": "Checks win condition by verifying all foundation piles are complete.",
  "frontend/src/features/solitaire/useSolitaireGame.ts": "Reducer-driven state manager for Solitaire gameplay, including moves, hints, history, and UI selection.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries are needed for the Solitaire game.",
  "frontend/src/hooks/useRobotsPolicy.ts": "Sets or updates the robots meta tag based on publishing state to control search engine indexing.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables, dark mode tokens, and defensive CSS for card rendering artifacts.",
  "frontend/src/lib/utils.ts": "Exports a utility function combining clsx and tailwind-merge for className merging.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider before rendering the root component.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, tokens, plugins, component styling, and extended theme options.",
  "project_state.json": "Describes project state, pending live-publishing features, and environment requirements for switching from draft to live mode."
}