{
  "backend/main.mo": "Minimal Motoko canister with an empty actor definition.",
  "feature_evidence.json": "Feature evidence report listing implemented Solitaire bug fixes, involved files, components, and test IDs.",
  "frontend-file-summaries.txt": "Pre-generated summaries describing the purpose of each frontend Solitaire source file.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color themes for light and dark modes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component applying dark theme styling and rendering SolitairePage.",
  "frontend/src/features/solitaire/components/CardView.tsx": "UI component rendering individual cards with styling, selection, hint effects, and drag‑and‑drop hooks.",
  "frontend/src/features/solitaire/components/GameControls.tsx": "Button bar providing New Game, Undo, and Hint actions.",
  "frontend/src/features/solitaire/components/PileView.tsx": "Generic pile renderer handling tableau, waste, and foundation layouts with stable keyed card rendering and drag‑and‑drop zones.",
  "frontend/src/features/solitaire/components/WinDialog.tsx": "Victory dialog modal shown when the player wins, with a button to start a new game.",
  "frontend/src/features/solitaire/solitaireDrag.ts": "Handles drag payload serialization, validation, and extraction for solitaire card movements.",
  "frontend/src/features/solitaire/solitaireHint.ts": "Computes the next valid hint move by scanning waste, tableau, foundations, and stock.",
  "frontend/src/features/solitaire/solitaireHistory.ts": "Implements undo history management for game states with push/pop operations.",
  "frontend/src/features/solitaire/solitaireLogic.ts": "Contains core solitaire rules including deck creation, shuffling, dealing, card placement, and stock drawing.",
  "frontend/src/features/solitaire/SolitairePage.tsx": "Main game container managing gameplay state, click logic, hints, and full drag‑and‑drop behavior.",
  "frontend/src/features/solitaire/solitaireTypes.ts": "Defines card, game state, selection, hint, and drag types plus helpers for suits and ranks.",
  "frontend/src/features/solitaire/solitaireWin.ts": "Checks if all foundation piles are complete to determine a win.",
  "frontend/src/features/solitaire/useSolitaireGame.ts": "React hook managing solitaire state, actions, moves, history, hints, and win detection.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user's identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides identity loading, login, logout, and context management using Internet Identity.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder indicating no backend queries are required for solitaire.",
  "frontend/src/index.css": "Defines Tailwind CSS layers and custom light/dark theme variables.",
  "frontend/src/lib/utils.ts": "Exports a utility for merging Tailwind class names.",
  "frontend/src/main.tsx": "Initializes React app with query and identity providers and mounts it to the DOM.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, extended theme colors, animations, and plugins.",
  "project_state.json": "Project metadata describing solitaire game goals, architecture notes, known bugs, and implemented feature versions."
}