{
  "backend/main.mo": "Minimal Motoko actor stub with no implemented logic.",
  "feature_evidence.json": "Feature evidence report mapping requested UI and CSS fixes to relevant frontend files and components.",
  "frontend-file-summaries.txt": "Collection of autogenerated summaries describing responsibilities of all frontend source files.",
  "frontend/.env.draft": "Environment file enabling draft publishing state during development builds.",
  "frontend/index.css": "Tailwind base/theme configuration defining OKLCH color variables for light and dark modes with global resets.",
  "frontend/index.html": "Base HTML entrypoint loading the React app with a default noindex robots tag.",
  "frontend/README-publishing.md": "Documentation explaining maintenance, draft, and live publishing modes and how to configure them.",
  "frontend/src/App.tsx": "Root component selecting maintenance, draft, or live UI and applying robots policy based on publishing state.",
  "frontend/src/components/DraftIndicator.tsx": "Displays a small fixed-position badge indicating draft mode.",
  "frontend/src/components/MaintenanceMode.tsx": "Centered maintenance notice screen with icon and messaging.",
  "frontend/src/config/publishing.ts": "Logic for determining current publishing mode from environment variables with legacy compatibility.",
  "frontend/src/features/solitaire/components/CardView.tsx": "Renders a face‑up or face‑down card with ring‑based interaction states, draggable support, and defensive CSS hooks.",
  "frontend/src/features/solitaire/components/GameControls.tsx": "Renders Solitaire control buttons for new game, undo, hint, scores, and preferences with callbacks and state-based enablement.",
  "frontend/src/features/solitaire/components/GameMoves.tsx": "Displays the move counter or a disabled message based on tracking state.",
  "frontend/src/features/solitaire/components/GamePreferencesDialog.tsx": "Dialog for editing timer, move tracking, and ask-again settings with local state synced to current preferences.",
  "frontend/src/features/solitaire/components/GameTimer.tsx": "Shows formatted elapsed time or a disabled message depending on timer state.",
  "frontend/src/features/solitaire/components/NewGamePreferencesDialog.tsx": "Dialog prompting for timer and move-tracking preferences before starting a new game, resetting values on open.",
  "frontend/src/features/solitaire/components/PileView.tsx": "Renders a card pile with special handling for empty, waste, foundation, and tableau piles, including drag-and-drop support.",
  "frontend/src/features/solitaire/components/ScoresDialog.tsx": "Leaderboard dialog displaying best times and least-move results with scrolling and formatted entries.",
  "frontend/src/features/solitaire/components/WinDialog.tsx": "Win screen showing current results and top performances with options to start a new game.",
  "frontend/src/features/solitaire/hooks/useGameTimer.ts": "Custom hook that tracks elapsed game time with start/stop logic and provides formatted output.",
  "frontend/src/features/solitaire/preferences/solitairePreferences.ts": "Loads and saves solitaire preference flags to localStorage with validation and defaults.",
  "frontend/src/features/solitaire/results/usePlaythroughResults.ts": "Manages stored playthrough results, leaderboards, and time formatting using React state and localStorage.",
  "frontend/src/features/solitaire/solitaireDrag.ts": "Handles drag-and-drop payload encoding, decoding, and conversion to selection objects.",
  "frontend/src/features/solitaire/solitaireHint.ts": "Computes the next valid move hint by checking prioritized move types.",
  "frontend/src/features/solitaire/solitaireHistory.ts": "Implements undo history with snapshots of game state and move counts.",
  "frontend/src/features/solitaire/solitaireLogic.ts": "Defines deck generation, dealing, card placement rules, drawing, and move validation helpers.",
  "frontend/src/features/solitaire/SolitairePage.tsx": "Main Solitaire game container managing state, dialogs, preferences, timer, win tracking, and drag‑and‑drop integration.",
  "frontend/src/features/solitaire/solitaireTypes.ts": "Contains core solitaire type definitions, constants, and card utility functions.",
  "frontend/src/features/solitaire/solitaireWin.ts": "Checks win condition by verifying all foundation piles contain 13 cards.",
  "frontend/src/features/solitaire/useSolitaireGame.ts": "React reducer managing game state, moves, history, hints, and interactions using solitaire logic utilities.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor tied to Internet Identity and refreshes dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides identity context, login handling, and persistence via Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries are used for solitaire.",
  "frontend/src/hooks/useRobotsPolicy.ts": "React hook that ensures a robots meta tag exists and updates its content based on the publishing state.",
  "frontend/src/index.css": "Tailwind base stylesheet defining theme tokens, dark-mode variables, and defensive CSS for draggable and card elements.",
  "frontend/src/lib/utils.ts": "Utility function combining clsx and tailwind-merge to merge class names safely.",
  "frontend/src/main.tsx": "Application entry that initializes React, wraps the app with React Query and Internet Identity providers, and loads global styles.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, tokens, shadows, and animations using custom CSS variables and plugins.",
  "project_state.json": "Project state metadata describing reflective rendering issues in a solitaire app and listing related styling fix features."
}