{
  "backend/main.mo": "Minimal Motoko actor placeholder with no logic.",
  "feature_evidence.json": "Feature evidence report listing two Solitaire UI changes and their affected files and components.",
  "frontend-file-summaries.txt": "Collection of autogenerated summaries describing the purpose of each frontend file in the project.",
  "frontend/.env.draft": "Draft environment config enabling draft mode, flat visuals, and img-based card rendering.",
  "frontend/.env.live.example": "Example production environment config enabling live mode, full visuals, and DOM-based card rendering.",
  "frontend/index.css": "Tailwind CSS base and theme variable definitions for light and dark modes with global styling rules.",
  "frontend/index.html": "HTML entry point setting up the root element and default robots policy with Simple Solitaire title.",
  "frontend/README-publishing.md": "Documentation explaining the app’s maintenance, draft, and live publishing modes and how to configure them.",
  "frontend/src/App.tsx": "Root React component selecting maintenance, draft, or live UI and applying robots policy.",
  "frontend/src/components/DraftIndicator.tsx": "Displays a small fixed-position Draft badge when in draft publishing mode.",
  "frontend/src/components/MaintenanceMode.tsx": "Centered maintenance screen with icon and status messaging.",
  "frontend/src/config/cardRenderMode.ts": "Reads env variables to determine card rendering mode (dom, background-image, img).",
  "frontend/src/config/publishing.ts": "Resolves publishing state (maintenance, draft, live) from env variables with legacy support.",
  "frontend/src/config/visualEffects.ts": "Reads env variable controlling advanced shading effects for the UI.",
  "frontend/src/features/solitaire/components/cardBackgroundImages.ts": "Generates SVG-based image sources and CSS backgrounds for card faces and backs.",
  "frontend/src/features/solitaire/components/CardView.tsx": "Renders a solitaire card using img or background-image modes, supporting click, selection, hinting, and drag events.",
  "frontend/src/features/solitaire/components/GameControls.tsx": "Displays control buttons for new game, undo, hint, scores, and preferences with icons and enabled states.",
  "frontend/src/features/solitaire/components/GameMoves.tsx": "Shows the current move count or a disabled message depending on tracking state.",
  "frontend/src/features/solitaire/components/GamePreferencesDialog.tsx": "A dialog for editing timer, move tracking, and ask-again preferences with state reset on open.",
  "frontend/src/features/solitaire/components/GameTimer.tsx": "Displays formatted elapsed time or a disabled message when timing is off.",
  "frontend/src/features/solitaire/components/NewGamePreferencesDialog.tsx": "Dialog prompting for timer, move tracking, and ask-again settings before starting a new game.",
  "frontend/src/features/solitaire/components/PileView.tsx": "Renders waste, foundation, or tableau piles, handling empty states, card cascading, clicks, and drag-and-drop.",
  "frontend/src/features/solitaire/components/ScoresDialog.tsx": "Dialog showing leaderboards for best times and fewest moves using scrollable lists.",
  "frontend/src/features/solitaire/components/WinDialog.tsx": "React dialog showing win results, current stats, and leaderboards with options for new games.",
  "frontend/src/features/solitaire/hooks/useGameTimer.ts": "React hook providing an elapsed game timer with formatting and start/stop behavior.",
  "frontend/src/features/solitaire/preferences/solitairePreferences.ts": "Loads and saves user solitaire preferences to localStorage with default fallbacks.",
  "frontend/src/features/solitaire/results/usePlaythroughResults.ts": "Manages stored playthrough results, adding entries and computing best times and moves.",
  "frontend/src/features/solitaire/solitaireDrag.ts": "Handles drag-and-drop payload encoding, decoding, and conversion to selection objects.",
  "frontend/src/features/solitaire/solitaireHint.ts": "Computes the next available hint by checking legal moves in priority order.",
  "frontend/src/features/solitaire/solitaireHistory.ts": "Implements undo history for game states with snapshot management and move tracking.",
  "frontend/src/features/solitaire/solitaireLogic.ts": "Core solitaire logic including deck creation, dealing, move rules, and state transitions.",
  "frontend/src/features/solitaire/SolitairePage.tsx": "Main Solitaire gameplay page managing state, dialogs, timers, results, drag-and-drop, and UI layout.",
  "frontend/src/features/solitaire/solitaireTypes.ts": "Type definitions for cards, game state, selections, hints, and helper utilities.",
  "frontend/src/features/solitaire/solitaireWin.ts": "Checks if all foundation piles are complete, indicating a win state.",
  "frontend/src/features/solitaire/useSolitaireGame.ts": "Implements a reducer-based solitaire game state manager handling moves, history, hints, selection, and undo logic.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity, refreshing dependent queries when the actor updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and helpers for Internet Identity login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file indicating no backend queries are needed for the solitaire game.",
  "frontend/src/hooks/useRobotsPolicy.ts": "Sets or updates the robots meta tag based on publishing state to allow or block search engine indexing.",
  "frontend/src/index.css": "Defines Tailwind base layers, theme tokens, dark mode values, and defensive styling for draggable solitaire cards.",
  "frontend/src/lib/utils.ts": "Exports a utility function combining clsx and tailwind-merge for merging class names.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, loading global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, tokens, plugins, and extended theme options for the solitaire UI.",
  "project_state.json": "Stores project metadata, existing and pending feature requests, and versioned project state."
}