{
  "backend/main.mo": "Minimal Motoko canister actor with no methods.",
  "feature_evidence.json": "Feature evidence report listing gameplay changes, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend solitaire-related file.",
  "frontend/index.css": "Tailwind base styles and OKLCH theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top-level React component applying dark theme and rendering SolitairePage.",
  "frontend/src/features/solitaire/components/CardView.tsx": "Renders an individual card with face-up/down styling and click/drag behavior.",
  "frontend/src/features/solitaire/components/GameControls.tsx": "Button bar providing New Game, Undo, Hint, Scores, and Preferences actions.",
  "frontend/src/features/solitaire/components/GameMoves.tsx": "Displays move count or disabled message based on tracking setting.",
  "frontend/src/features/solitaire/components/GamePreferencesDialog.tsx": "Dialog allowing users to configure timer, move tracking, and confirmation options.",
  "frontend/src/features/solitaire/components/GameTimer.tsx": "Shows formatted play time or a disabled indicator depending on settings.",
  "frontend/src/features/solitaire/components/NewGamePreferencesDialog.tsx": "Dialog component allowing users to enable or disable timer, move tracking, and ask-again preferences when starting a new game.",
  "frontend/src/features/solitaire/components/PileView.tsx": "Renders a pile of cards with support for empty placeholders, waste/foundation top-card views, selection, hints, and drag-and-drop behavior.",
  "frontend/src/features/solitaire/components/ScoresDialog.tsx": "Leaderboard dialog showing best times and least-move playthroughs with scrolling and formatted entries.",
  "frontend/src/features/solitaire/components/WinDialog.tsx": "Win screen dialog displaying the player's result along with top leaderboard times and move counts.",
  "frontend/src/features/solitaire/hooks/useGameTimer.ts": "React hook providing a resettable, optionally enabled timer with formatted elapsed time.",
  "frontend/src/features/solitaire/preferences/solitairePreferences.ts": "Loads, validates, and saves timer, move tracking, and ask-again preferences using localStorage.",
  "frontend/src/features/solitaire/results/usePlaythroughResults.ts": "Manages persistent playthrough results, computes leaderboards, and formats elapsed time.",
  "frontend/src/features/solitaire/solitaireDrag.ts": "Defines drag-and-drop serialization for card moves, including payload validation and conversion to selection objects.",
  "frontend/src/features/solitaire/solitaireHint.ts": "Computes the next valid move suggestion by checking move priorities across waste, tableau, and foundation piles.",
  "frontend/src/features/solitaire/solitaireHistory.ts": "Implements history snapshots for undo functionality, tracking past game states and move counts.",
  "frontend/src/features/solitaire/solitaireLogic.ts": "Provides core solitaire mechanics including deck creation, shuffling, dealing, move validation, and stock drawing.",
  "frontend/src/features/solitaire/SolitairePage.tsx": "Main Solitaire UI managing game state, dialogs, timer, moves, preferences, and interactions.",
  "frontend/src/features/solitaire/solitaireTypes.ts": "Defines card, game state, selection, and helper utilities such as rank values and suit colors.",
  "frontend/src/features/solitaire/solitaireWin.ts": "Checks if all foundation piles are complete to determine a win.",
  "frontend/src/features/solitaire/useSolitaireGame.ts": "React reducer hook managing solitaire state transitions, moves, history, hints, and UI selections.",
  "frontend/src/hooks/useActor.ts": "Creates and refreshes a backend actor based on Internet Identity using react-query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, including login, logout, and identity restoration.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for query-related logic.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables and base styling.",
  "frontend/src/lib/utils.ts": "Utility function merging Tailwind class names safely.",
  "frontend/src/main.tsx": "App entry point initializing React, query client, and identity provider before rendering the app.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, extended OKLCH-based color system, container settings, custom animations, and typography/container-query/animate plugins.",
  "project_state.json": "Defines the solitaire project's state, including requirements, architectural notes, known issues, and feature metadata for ongoing fixes."
}