{
  "backend/main.mo": "Empty Motoko actor serving as a backend placeholder.",
  "feature_evidence.json": "Feature evidence report describing locked foundation behavior and related UI files.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend Solitaire files for reference.",
  "frontend/index.css": "Tailwind and OKLCH-based theme definitions for light and dark modes with global styling.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Root React component applying dark theme and rendering SolitairePage.",
  "frontend/src/features/solitaire/components/CardView.tsx": "Card renderer supporting locked state, drag behavior, suit colors, and visual highlighting.",
  "frontend/src/features/solitaire/components/GameControls.tsx": "UI bar providing New Game, Undo, and Hint buttons.",
  "frontend/src/features/solitaire/components/PileView.tsx": "Generic pile renderer managing card layout, locked foundations, and drag-drop zones.",
  "frontend/src/features/solitaire/components/WinDialog.tsx": "Modal dialog showing a win message and restart button.",
  "frontend/src/features/solitaire/solitaireDrag.ts": "Implements drag payload serialization, validation, and extraction for solitaire card dragging, blocking foundation-origin drags.",
  "frontend/src/features/solitaire/solitaireHint.ts": "Scans game state to find the next valid solitaire move, excluding moves from foundations.",
  "frontend/src/features/solitaire/solitaireHistory.ts": "Provides undo history management with functions to push, pop, and check undo availability.",
  "frontend/src/features/solitaire/solitaireLogic.ts": "Contains core solitaire rules including deck creation, shuffling, dealing, move validation, and stock drawing.",
  "frontend/src/features/solitaire/SolitairePage.tsx": "Main Solitaire UI handling game interactions, enforcing locked foundations, and managing drag-drop and hints.",
  "frontend/src/features/solitaire/solitaireTypes.ts": "Defines card, game state, selection, drag, and hint types plus helper ranking and suit utilities.",
  "frontend/src/features/solitaire/solitaireWin.ts": "Checks if all foundation piles are complete to determine a win.",
  "frontend/src/features/solitaire/useSolitaireGame.ts": "React reducer and logic wrapper managing game state, moves, hints, undo, and win detection.",
  "frontend/src/hooks/useActor.ts": "Creates and updates a backend actor based on the user's Internet Identity, invalidating related queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, persistence, and context management using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder indicating solitaire has no backend queries.",
  "frontend/src/index.css": "Defines Tailwind-based theme variables and global styles for light and dark modes.",
  "frontend/src/lib/utils.ts": "Exports a utility for merging Tailwind class names cleanly.",
  "frontend/src/main.tsx": "Bootstraps the app with React, QueryClient, and InternetIdentity providers.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended OKLCH color system, custom animations, and typography/container/animate plugins.",
  "project_state.json": "Defines the solitaire project's state, feature set, issues, and architectural notes for building and fixing a Klondike game with dark theme UI."
}