{
  "backend/main.mo": "Minimal Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence report describing implemented Solitaire dialog behaviors and associated files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend Solitaire files for reference or documentation.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme CSS variables and base styles.",
  "frontend/index.html": "HTML entry point that loads the React app via main.tsx into the root div.",
  "frontend/src/App.tsx": "Root React component enabling dark mode and rendering the Solitaire page.",
  "frontend/src/features/solitaire/components/CardView.tsx": "Renders individual cards with suit styling, lock state, face-down appearance, and optional drag interactions.",
  "frontend/src/features/solitaire/components/GameControls.tsx": "Toolbar component providing buttons for new game, undo, hint, scores, and preferences.",
  "frontend/src/features/solitaire/components/GameMoves.tsx": "Displays move count or a disabled indicator depending on tracking settings.",
  "frontend/src/features/solitaire/components/GamePreferencesDialog.tsx": "Modal dialog allowing users to configure timer, move tracking, and ask-again settings.",
  "frontend/src/features/solitaire/components/GameTimer.tsx": "Shows formatted elapsed time or a disabled message based on timer settings.",
  "frontend/src/features/solitaire/components/NewGamePreferencesDialog.tsx": "A dialog allowing players to toggle timer, move tracking, and ask-again preferences before starting a new game.",
  "frontend/src/features/solitaire/components/PileView.tsx": "Component for rendering card piles with support for click selection, hints, empty states, and drag-and-drop interactions.",
  "frontend/src/features/solitaire/components/ScoresDialog.tsx": "Leaderboard dialog displaying best times and move counts using provided playthrough results.",
  "frontend/src/features/solitaire/components/WinDialog.tsx": "Win screen showing the player's result and top leaderboard entries with an option to start a new game.",
  "frontend/src/features/solitaire/hooks/useGameTimer.ts": "Hook managing a game timer tied to game instance, with start/stop control and formatted elapsed time.",
  "frontend/src/features/solitaire/preferences/solitairePreferences.ts": "LocalStorage-backed module for loading and saving timer, move tracking, and ask-again preferences.",
  "frontend/src/features/solitaire/results/usePlaythroughResults.ts": "Hook storing playthrough results in localStorage and deriving leaderboards sorted by time and moves.",
  "frontend/src/features/solitaire/solitaireDrag.ts": "Utility functions for encoding, validating, and handling drag-and-drop payloads for moving cards.",
  "frontend/src/features/solitaire/solitaireHint.ts": "Generates the first valid hint by checking moves from waste or tableau to foundations or tableau, or drawing from stock.",
  "frontend/src/features/solitaire/solitaireHistory.ts": "Implements snapshot-based history tracking with undo support for solitaire game states.",
  "frontend/src/features/solitaire/solitaireLogic.ts": "Provides core solitaire logic including deck creation, shuffling, dealing, card movement rules, and stock drawing.",
  "frontend/src/features/solitaire/SolitairePage.tsx": "Main Solitaire gameplay container managing state, dialogs, preferences, timer, and result tracking.",
  "frontend/src/features/solitaire/solitaireTypes.ts": "Defines card, game state, selection, hint structures, and utility helpers for ranks, suits, and colors.",
  "frontend/src/features/solitaire/solitaireWin.ts": "Checks whether all foundation piles contain 13 cards to determine a win.",
  "frontend/src/features/solitaire/useSolitaireGame.ts": "React reducer hook managing solitaire state, moves, history, hints, and UI interactions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor using identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity context with login, logout, identity loading, and auth-client management.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder indicating no backend queries are needed for solitaire.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark theming.",
  "frontend/src/lib/utils.ts": "Exports a utility to merge and normalize class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom OKLCH color tokens, extended animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing solitaire game goals, architecture notes, known bugs, and existing feature definitions for tracking build state."
}