{
  "kind": "build_request",
  "title": "Store per-playthrough results and display separate best-time and best-moves leaderboards",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-25",
      "text": "Record a completed-playthrough result when (and only when) the user wins a game, capturing both (a) elapsed time in seconds from the game timer and (b) the current drag-move counter value for that playthrough.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Let's track the time and number of moves separately storing them into two different categories. Lower time ranks higher, fewer moves ranks higher. Note the values of each for each playthrough and compile the results into a list for each stored category."
        ]
      },
      "acceptanceCriteria": [
        "When the win condition is reached, exactly one result entry is created for that playthrough (no duplicate entries due to re-renders).",
        "Each recorded entry contains both elapsedSeconds and moves for that same playthrough.",
        "Starting a New Game resets the in-progress timer and move counter as it does today, but does not delete previously recorded results."
      ]
    },
    {
      "id": "REQ-26",
      "text": "Persist the history of recorded playthrough results on the client so the results remain available across page reloads (e.g., using localStorage), and load the persisted results on app start.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "...storing them into two different categories."
        ]
      },
      "acceptanceCriteria": [
        "After winning at least one game, reloading the page keeps the previously recorded results available to the UI.",
        "Persisted data is resilient to an empty/missing storage value (no crashes; defaults to empty lists)."
      ]
    },
    {
      "id": "REQ-27",
      "text": "Compile and display two separate ranked lists derived from the recorded playthrough results: (1) Best Times ranked by lower completion time first, and (2) Best Moves ranked by fewer moves first. Each list entry must show both the primary metric and the other metric for that same playthrough (e.g., a time-ranked entry also shows its moves).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Lower time ranks higher, fewer moves ranks higher. Note the values of each for each playthrough and compile the results into a list for each stored category."
        ]
      },
      "acceptanceCriteria": [
        "The Best Times list is sorted ascending by elapsed time (lower ranks higher).",
        "The Best Moves list is sorted ascending by moves (fewer ranks higher).",
        "Each displayed row clearly shows the playthrough’s time (HH:MM:SS) and moves value.",
        "If there are no recorded results yet, the UI shows an English empty-state message for each list (e.g., \"No completed games yet.\")."
      ]
    },
    {
      "id": "REQ-28",
      "text": "Update the win UI so that, when the win dialog is shown, it includes the current playthrough’s completion time and moves, plus the two ranked lists (Best Times and Best Moves) in the same dialog or immediately adjacent UI section, using English labels.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Note the values of each for each playthrough and compile the results into a list for each stored category."
        ]
      },
      "acceptanceCriteria": [
        "On win, the dialog shows the player’s completion time and moves for that win.",
        "On win, the dialog shows both ranked lists (Best Times and Best Moves) populated from stored results.",
        "All user-facing text added for this feature is in English.",
        "The existing 'Play Again' action continues to start a new game as it does today."
      ]
    }
  ],
  "constraints": [
    "Frontend files under frontend/src/components/ui must be treated as read-only and only composed, not edited.",
    "Do not edit any paths listed in frontend.immutablePaths.",
    "Keep all changes compatible with the existing timer hook (frontend/src/features/solitaire/hooks/useGameTimer.ts) and move counter logic (frontend/src/features/solitaire/solitaireHistory.ts)."
  ],
  "nonGoals": [
    "Do not add third-party authentication providers; Internet Identity remains the only supported auth option.",
    "Do not implement real-time/multiplayer leaderboards or server-side/global rankings.",
    "Do not change the existing Klondike rules, drag-and-drop rules, or the definition of what counts as a move (drag-and-drop successful moves only)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}