{
  "kind": "build_request",
  "title": "Rename header title to “Simple Solitaire” and center card layout",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the top header title on the Solitaire page to read exactly \"Simple Solitaire\" and leave all other existing text unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I would like the Top title to read as Simple Solitaire, all other text to remain the same."
        ]
      },
      "acceptanceCriteria": [
        "On the main Solitaire page header, the large centered title text displays \"Simple Solitaire\".",
        "No other user-facing text strings are changed (e.g., footer text, empty pile placeholders, button labels, dialogs)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Center the card layout (top row: stock/waste/foundations; and tableau row) horizontally within the page across responsive breakpoints, without breaking drag-and-drop interactions or causing horizontal overflow on typical viewport widths.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Regarding format, can the cards be centered in the web page without causing issues?"
        ]
      },
      "acceptanceCriteria": [
        "On desktop and mobile widths, the top row of piles and the tableau piles are visually centered within the main content area (not left-aligned on larger screens).",
        "Drag-and-drop still functions correctly for tableau and foundation drop targets after the layout change.",
        "The layout remains responsive: piles can wrap to new lines as needed and no new persistent horizontal scrollbar is introduced on common screen sizes."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Keep the application backend unchanged (no Motoko changes required)."
  ],
  "nonGoals": [
    "Do not change any other copy besides the top header title text.",
    "Do not redesign the game, add new controls, or change game rules/logic."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}