{
  "kind": "build_request",
  "title": "Remove foundation lock so suit spaces are fully interactive",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-43",
      "text": "Remove the foundation (suit space) \"locked\" behavior so foundation piles can be used as move sources again (via click-to-select and drag-and-drop), while still enforcing existing Klondike move rules.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Let's remove the LOCK feature from the suit spaces"
        ]
      },
      "acceptanceCriteria": [
        "A player can click the top card in a foundation pile to select it, and then click a tableau pile to attempt a move; the move succeeds only when rules allow and otherwise leaves state unchanged.",
        "A player can drag the top card from a foundation pile and drop it onto a tableau pile; the move succeeds only when rules allow and otherwise leaves state unchanged (no stranded/missing cards).",
        "Dragging from foundations is no longer blocked in drag payload validation/serialization, and drops originating from foundations are handled normally.",
        "Existing restrictions remain in place: only the top foundation card can move; no multi-card moves from foundations; all move legality is still enforced by the current Klondike rules."
      ]
    },
    {
      "id": "REQ-44",
      "text": "Remove the visual lock affordance and disabled styling from foundation top cards, so foundation cards look and behave like normal interactive cards when they are draggable/selectable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Let's remove the LOCK feature from the suit spaces"
        ]
      },
      "acceptanceCriteria": [
        "The lock icon overlay is no longer rendered on foundation cards.",
        "Foundation cards no longer show a locked/disabled cursor (e.g., no cursor-not-allowed) and do not appear visually \"locked\" (e.g., no forced opacity changes for lock state).",
        "Foundation top cards regain normal hover/active styling consistent with other interactive cards (while still respecting any existing selection/hint styling)."
      ]
    },
    {
      "id": "REQ-45",
      "text": "Update the Hint behavior to include legal moves FROM foundation piles (e.g., foundation top card to a valid tableau pile), since foundations are no longer locked.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Let's remove the LOCK feature from the suit spaces"
        ]
      },
      "acceptanceCriteria": [
        "When at least one legal move exists from a foundation top card to a tableau pile, the Hint system can return and highlight such a move.",
        "Hint behavior for waste-to-foundation, waste-to-tableau, tableau-to-foundation, and tableau-to-tableau remains functional and unchanged in intent."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (read-only UI components must be composed, not modified).",
    "Do not modify the immutable hook files listed in SYSTEM_CONTEXT (frontend/src/hooks/useInternetIdentity.ts/tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Keep backend as a single Motoko actor; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Do not change Klondike legality rules (only remove the foundation lock restriction).",
    "Do not add new scoring, timer, or leaderboard features.",
    "Do not redesign the overall visual theme beyond removing lock-specific visuals on foundation cards."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}