{
  "kind": "build_request",
  "title": "Inspect and fix solitaire card styles causing reflective artifacts in Chromium",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Audit and update the solitaire card component styling so cards render without reflection/shine-like artifacts in Chromium browsers (Chrome/Edge) across all piles (stock/back-of-card, waste, foundation, tableau).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "inspect the card styles"
        ]
      },
      "acceptanceCriteria": [
        "In Chrome and Edge, cards do not show any mirrored/reflection-like artifact beneath or around the card during idle, hover, drag, and drop states.",
        "The fix applies consistently to face-up and face-down cards and to cards rendered in waste, foundation, and tableau piles.",
        "Card visuals (border radius, border, suit colors, and general shadow presence) remain coherent and do not regress in Firefox/Safari."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Remove or replace any transform-based hover/active visual effects on cards and card containers that could trigger unwanted GPU compositing artifacts, while preserving clear hover/pressed affordances using non-transform styling (e.g., ring/outline/brightness).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "inspect the card styles"
        ]
      },
      "acceptanceCriteria": [
        "No card element or its immediate wrapper applies transform-based scaling/3D transforms for hover/active feedback.",
        "Hover/active feedback remains visible and accessible (e.g., ring or outline) for clickable/draggable face-up cards.",
        "Dragging a card does not introduce new shadows/reflections during the drag operation in Chrome/Edge."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Harden global CSS defenses specifically for the card element and its wrappers to disable reflection-causing properties (e.g., -webkit-box-reflect, filter/backdrop-filter, mix-blend-mode, 3D transform settings) without breaking legitimate styling elsewhere.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "inspect the card styles"
        ]
      },
      "acceptanceCriteria": [
        "Global CSS rules explicitly neutralize reflection- and compositing-prone properties for the card element selector(s) and the card wrapper selector(s).",
        "Defensive CSS targets the actual card elements and wrappers used by the solitaire UI (including data attributes and existing utility classes).",
        "No new visual regressions appear in non-card UI elements (dialogs, buttons, header) due to overly broad CSS selectors."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Verify and, if needed, adjust the Tailwind shadow token used by cards (shadow-card) so it uses a standard, subtle box-shadow that does not trigger reflection-like artifacts in Chromium, and ensure shadow appearance is consistent between face-up and face-down cards.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "inspect the card styles"
        ]
      },
      "acceptanceCriteria": [
        "The card shadow uses a conventional box-shadow (no filters) and renders consistently in Chrome/Edge without reflective artifacts.",
        "Face-up and face-down cards both use the same safe shadow approach (or a deliberately chosen, safe variant) with consistent visual weight.",
        "Any Tailwind theme/shadow changes do not break other components that rely on existing shadow tokens."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui) must not be edited.",
    "Backend must remain single-actor; no new backend services.",
    "Do not introduce WebSockets/real-time messaging, third-party auth providers, or external databases."
  ],
  "nonGoals": [
    "Adding new gameplay features or changing solitaire rules.",
    "Implementing backend persistence for game state or scores (current localStorage approach is out of scope unless required for styling fixes).",
    "Redesigning the overall page theme beyond what is necessary to resolve the reflective artifact and keep card visuals consistent."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}