{
  "kind": "build_request",
  "title": "Fix empty tableau column drop target after moving last card to foundation",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-42",
      "text": "Fix the bug where, after the last remaining card is moved out of a tableau column (e.g., the first tableau pile that started as a single card) into a foundation pile, the now-empty tableau space is not usable as a drop target to start a new descending stack. Empty tableau columns must continue to render a visible drop zone and accept valid drag-and-drop moves (e.g., dropping a King or King-led run) according to existing Klondike rules.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "There appears to be an issue where if the first (single) card stack is itself stacked into an appropriate suit stack, the remaining space is unavailable to use to start a new descending stack"
        ]
      },
      "acceptanceCriteria": [
        "Given a tableau column becomes empty after moving its last card to a foundation, the UI still shows an empty slot/drop zone in that tableau position (not a blank, non-interactive area).",
        "Dragging a King (or a face-up run starting with a King) from the waste or another tableau pile onto the empty tableau column succeeds and updates the game state correctly.",
        "Dragging a non-King card/run onto an empty tableau column is rejected (state does not change), consistent with existing rules.",
        "The empty tableau drop zone provides the same drag-over highlighting behavior used for other drop targets (when applicable)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui or any frontend immutablePaths listed in SYSTEM_CONTEXT.",
    "Keep all backend Motoko logic unchanged; this is a frontend rendering/interaction bug."
  ],
  "nonGoals": [
    "Changing Klondike move rules (e.g., allowing non-Kings onto empty tableau columns).",
    "Adding new gameplay features unrelated to tableau empty-slot drop behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}