{
  "kind": "build_request",
  "title": "Lock foundation piles (upper four slots) to prevent any interaction/move-out",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-17",
      "text": "Make all cards in the four foundation piles (upper slots) permanently non-interactive (“locked”): players must not be able to select, click, or drag cards from foundations after they are placed there, while still allowing valid drops onto foundations from the waste/tableau.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Still having the disappearing issue. Let's try: Once a card is stacked in the upper four slots they are incapable of interaction and will remain \"locked\"."
        ]
      },
      "acceptanceCriteria": [
        "Clicking a foundation pile that contains cards does not create a selection and does not attempt any move from foundation.",
        "Dragging from a foundation pile is not possible (no drag cursor/affordance; no drag payload created).",
        "Dropping a valid card from waste/tableau onto a foundation still works exactly as before.",
        "Undo still works for moves into foundations (undo can remove cards from foundations), but users still cannot directly move cards out of foundations via interaction.",
        "Hint does not suggest any move whose source is a foundation pile (no hints that require interacting with foundations as a source)."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Add a small visual “locked” affordance/state to foundation top cards to make it clear they cannot be interacted with (without changing the overall dark theme), and ensure hover/active styling does not imply interactivity for foundation cards.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Once a card is stacked in the upper four slots they are incapable of interaction and will remain \"locked\"."
        ]
      },
      "acceptanceCriteria": [
        "Foundation cards do not show hover scale/active press effects that imply click/drag interaction.",
        "A subtle locked visual state is visible on foundation top cards (e.g., reduced hover effects + small lock indicator/overlay), and it does not affect tableau/waste card styling.",
        "Waste and tableau interactivity (click, drag, hover styling) remains unchanged."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui or any frontend immutablePaths listed in SYSTEM_CONTEXT.",
    "Keep backend as a single Motoko actor; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Do not implement alternative fixes for the disappearing foundation drag bug that still allow moving cards out of foundations; foundations must remain locked per request.",
    "Do not add new game modes, scoring, timers, or additional solitaire rule variants."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}