{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Dismissable New Game Preferences dialog (X/ESC/outside) without starting a game",
  "requirements": [
    {
      "id": "REQ-40",
      "summary": "Add a top-right X close control and allow standard dialog dismissal for New Game Preferences without confirming or persisting changes",
      "acceptanceCriteria": [
        "When the New Game Preferences dialog is open, an upper-right X close button is visible and clickable.",
        "Clicking the X closes the dialog and does not start a new game.",
        "Clicking the X closes the dialog and does not persist/update any preferences (timer enabled, move tracking enabled, ask again).",
        "After closing via X, the game remains in its prior state (no reset/deal triggered)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/solitaire/components/NewGamePreferencesDialog.tsx",
          "operation": "modify",
          "description": "Update the New Game Preferences modal UI to include a top-right close control using shadcn-ui Dialog composition (e.g., DialogClose + X icon), and enable standard dismissal behavior (ESC / outside click) via the Dialog component. Ensure dismissal only closes the modal (no calls to onConfirm and no preference persistence). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-41",
      "summary": "Make New Game Preferences dialog controlled by parent open state, and reset option state from latest defaults on reopen",
      "acceptanceCriteria": [
        "The parent page can close the New Game Preferences dialog when the user dismisses it (e.g., via an onOpenChange callback).",
        "Re-opening the New Game Preferences dialog shows option values initialized from the latest provided defaults (not stale values from a previous open).",
        "Closing the dialog via X/dismiss does not call the confirm/start callback."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/solitaire/components/NewGamePreferencesDialog.tsx",
          "operation": "modify",
          "description": "Add an onOpenChange prop and wire it into the shadcn-ui Dialog so the parent can control open/close. Add an effect that re-initializes the dialog's local checkbox state from default* props whenever the dialog opens, matching the reset-on-open pattern used in the app's other preferences dialog. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/solitaire/SolitairePage.tsx",
          "operation": "modify",
          "description": "Wire NewGamePreferencesDialog as a controlled dialog by passing an onOpenChange handler that updates newGameDialogOpen. Ensure dismissing (X/ESC/outside) only closes the dialog and does not call the start/confirm flow or trigger a new game."
        }
      ]
    }
  ]
}