{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Make foundation piles interactive again (remove lock) with rules preserved",
  "requirements": [
    {
      "id": "REQ-43",
      "summary": "Allow selecting and dragging the top foundation card as a move source while preserving existing Klondike legality checks",
      "acceptanceCriteria": [
        "A player can click the top card in a foundation pile to select it, and then click a tableau pile to attempt a move; the move succeeds only when rules allow and otherwise leaves state unchanged.",
        "A player can drag the top card from a foundation pile and drop it onto a tableau pile; the move succeeds only when rules allow and otherwise leaves state unchanged (no stranded/missing cards).",
        "Dragging from foundations is no longer blocked in drag payload validation/serialization, and drops originating from foundations are handled normally.",
        "Existing restrictions remain in place: only the top foundation card can move; no multi-card moves from foundations; all move legality is still enforced by the current Klondike rules."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/solitaire/solitaireDrag.ts",
          "operation": "modify",
          "description": "Remove the explicit rejection of drag payloads originating from foundations in payload deserialization and drag-source validation so foundation sources can be serialized/validated like waste/tableau."
        },
        {
          "path": "frontend/src/features/solitaire/SolitairePage.tsx",
          "operation": "modify",
          "description": "Enable foundation top-card selection in click-to-select flow, enable foundation top-card dragging in drag-start logic and draggable predicate, and remove foundation-source rejection in drag/drop handlers while keeping move attempts routed through existing move legality enforcement."
        },
        {
          "path": "frontend/src/features/solitaire/components/PileView.tsx",
          "operation": "modify",
          "description": "Make foundation pile rendering use the same interactive wiring as other piles: pass through onCardClick for the top card, and allow draggable/onDragStart/onDragEnd for the top card when the parent marks it draggable (still only top card is rendered, so multi-card foundation drags are impossible)."
        }
      ]
    },
    {
      "id": "REQ-44",
      "summary": "Remove lock icon and locked/disabled styling from foundation top cards so they look and behave like normal interactive cards",
      "acceptanceCriteria": [
        "The lock icon overlay is no longer rendered on foundation cards.",
        "Foundation cards no longer show a locked/disabled cursor (e.g., no cursor-not-allowed) and do not appear visually \"locked\" (e.g., no forced opacity changes for lock state).",
        "Foundation top cards regain normal hover/active styling consistent with other interactive cards (while still respecting any existing selection/hint styling)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/solitaire/components/CardView.tsx",
          "operation": "modify",
          "description": "Remove the lock affordance (icon overlay) and the locked-only disabled styling/behavior gates so the component renders foundation cards with the same interactive styling rules as other draggable/selectable cards."
        },
        {
          "path": "frontend/src/features/solitaire/components/PileView.tsx",
          "operation": "modify",
          "description": "Remove/stop using the foundation-lock plumbing (e.g., isFoundationLocked -> CardView isLocked) so foundation top cards no longer receive forced locked styling and instead rely on normal draggable/selectable props."
        },
        {
          "path": "frontend/src/features/solitaire/SolitairePage.tsx",
          "operation": "modify",
          "description": "Stop passing locked/disabled flags to foundation piles/cards and ensure foundation top cards receive the same click/drag wiring as other interactive cards (selection and hint visuals should remain intact)."
        }
      ]
    },
    {
      "id": "REQ-45",
      "summary": "Extend Hint generation to include legal moves from foundation top cards to tableau piles",
      "acceptanceCriteria": [
        "When at least one legal move exists from a foundation top card to a tableau pile, the Hint system can return and highlight such a move.",
        "Hint behavior for waste-to-foundation, waste-to-tableau, tableau-to-foundation, and tableau-to-tableau remains functional and unchanged in intent."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/solitaire/solitaireHint.ts",
          "operation": "modify",
          "description": "Remove the foundation-lock assumption and add a scan for foundation->tableau moves (top card only) using existing tableau placement rules, returning the first such legal move without changing the existing hint priority for other move types."
        },
        {
          "path": "frontend/src/features/solitaire/SolitairePage.tsx",
          "operation": "modify",
          "description": "Ensure hint highlighting logic correctly supports hints whose source is a foundation pile (highlight the foundation top card as the hinted 'from' selection) while keeping existing hint highlighting behavior unchanged for other move types."
        }
      ]
    }
  ]
}