{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Lock foundation piles to disable interaction while keeping valid drops",
  "requirements": [
    {
      "id": "REQ-17",
      "summary": "Prevent selecting/clicking/dragging cards out of foundation piles while still allowing valid drops into foundations, undo for foundation moves, and hints that never use foundation as a source.",
      "acceptanceCriteria": [
        "Clicking a foundation pile that contains cards does not create a selection and does not attempt any move from foundation.",
        "Dragging from a foundation pile is not possible (no drag cursor/affordance; no drag payload created).",
        "Dropping a valid card from waste/tableau onto a foundation still works exactly as before.",
        "Undo still works for moves into foundations (undo can remove cards from foundations), but users still cannot directly move cards out of foundations via interaction.",
        "Hint does not suggest any move whose source is a foundation pile (no hints that require interacting with foundations as a source)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/solitaire/SolitairePage.tsx",
          "operation": "modify",
          "description": "Update click/selection and drag wiring so foundation piles are locked as sources: do not allow selecting from foundations when no prior selection, never start drag sessions from foundations, but still allow foundations to act as drop targets and click targets when a non-foundation selection exists (to attempt a move into foundations). Ensure the drag/drop flow and undo UI remain unchanged."
        },
        {
          "path": "frontend/src/features/solitaire/components/PileView.tsx",
          "operation": "modify",
          "description": "Adjust foundation pile rendering to avoid attaching click/drag handlers to the foundation top card for source interactions while preserving drop-zone handlers on the pile container. Ensure the foundation stack remains a valid drop target even when locked."
        },
        {
          "path": "frontend/src/features/solitaire/solitaireDrag.ts",
          "operation": "modify",
          "description": "Harden drag source validation to reject any drag payload whose source type is 'foundation', preventing a drag payload from being treated as valid even if created externally (e.g., via browser/DOM quirks)."
        },
        {
          "path": "frontend/src/features/solitaire/solitaireHint.ts",
          "operation": "modify",
          "description": "Confirm and enforce that hint generation never returns a hint whose from.type is 'foundation' (keep foundations as target-only). Add/adjust logic to exclude foundation-source scans if any exist now or are added later."
        }
      ]
    },
    {
      "id": "REQ-18",
      "summary": "Add a subtle locked visual state for foundation top cards and remove hover/active cues implying interactivity, without affecting tableau/waste styling or the dark theme.",
      "acceptanceCriteria": [
        "Foundation cards do not show hover scale/active press effects that imply click/drag interaction.",
        "A subtle locked visual state is visible on foundation top cards (e.g., reduced hover effects + small lock indicator/overlay), and it does not affect tableau/waste card styling.",
        "Waste and tableau interactivity (click, drag, hover styling) remains unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/solitaire/components/CardView.tsx",
          "operation": "modify",
          "description": "Add a foundation-lock visual state (e.g., small lock indicator overlay on the top card) and adjust classes so when locked it uses non-interactive cursor and suppresses hover/active transform/press styles; keep existing styling unchanged for waste/tableau and other cards."
        },
        {
          "path": "frontend/src/features/solitaire/components/PileView.tsx",
          "operation": "modify",
          "description": "Pass a dedicated 'locked' / 'interactionDisabled' flag to CardView for foundation top cards only, ensuring the locked styling applies only to foundation stacks and not to waste/tableau cards."
        }
      ]
    }
  ]
}